const dictToTwotwo = {
  'あ': 'トゥートゥートゥトゥートゥー',
  'い': 'トゥトゥー',
  'う': 'トゥトゥトゥー',
  'え': 'トゥートゥトゥートゥートゥー',
  'お': 'トゥトゥートゥトゥトゥ',
  'か': 'トゥトゥートゥトゥ',
  'き': 'トゥートゥトゥートゥトゥ',
  'く': 'トゥトゥトゥトゥー',
  'け': 'トゥートゥトゥートゥー',
  'こ': 'トゥートゥートゥートゥー',
  'さ': 'トゥートゥトゥートゥトゥー',
  'し': 'トゥートゥートゥトゥートゥ',
  'す': 'トゥートゥートゥートゥトゥー',
  'せ': 'トゥトゥートゥートゥートゥ',
  'そ': 'トゥートゥートゥートゥ',
  'た': 'トゥートゥ',
  'ち': 'トゥトゥトゥートゥ',
  'つ': 'トゥトゥートゥートゥ',
  'て': 'トゥトゥートゥトゥートゥー',
  'と': 'トゥトゥトゥートゥトゥ',
  'な': 'トゥトゥートゥ',
  'に': 'トゥートゥトゥートゥ',
  'ぬ': 'トゥトゥトゥトゥ',
  'ね': 'トゥートゥートゥトゥー',
  'の': 'トゥトゥトゥートゥー',
  'は': 'トゥートゥトゥトゥ',
  'ひ': 'トゥートゥートゥトゥトゥー',
  'ふ': 'トゥートゥートゥトゥ',
  'へ': 'トゥ',
  'ほ': 'トゥートゥトゥ',
  'ま': 'トゥートゥトゥトゥー',
  'み': 'トゥトゥトゥートゥトゥー',
  'む': 'トゥー',
  'め': 'トゥートゥトゥトゥトゥー',
  'も': 'トゥートゥトゥトゥートゥ',
  'や': 'トゥトゥートゥー',
  'ゆ': 'トゥートゥトゥトゥートゥー',
  'よ': 'トゥートゥー',
  'ら': 'トゥトゥトゥ',
  'り': 'トゥートゥートゥ',
  'る': 'トゥートゥトゥートゥートゥ',
  'れ': 'トゥートゥートゥー',
  'ろ': 'トゥトゥートゥトゥー',
  'わ': 'トゥートゥトゥー',
  'ゐ': 'トゥトゥートゥトゥトゥー',
  'ゑ': 'トゥトゥートゥートゥトゥ',
  'を': 'トゥトゥートゥートゥー',
  'ん': 'トゥトゥートゥトゥートゥ',

  'が': 'トゥトゥートゥトゥ トゥトゥ',
  'ぎ': 'トゥートゥトゥートゥトゥ トゥトゥ',
  'ぐ': 'トゥトゥトゥトゥー トゥトゥ',
  'げ': 'トゥートゥトゥートゥー トゥトゥ',
  'ご': 'トゥートゥートゥートゥー トゥトゥ',
  'ざ': 'トゥートゥトゥートゥトゥー トゥトゥ',
  'じ': 'トゥートゥートゥトゥートゥ トゥトゥ',
  'ず': 'トゥートゥートゥートゥトゥー トゥトゥ',
  'ぜ': 'トゥトゥートゥートゥートゥ トゥトゥ',
  'ぞ': 'トゥートゥートゥートゥ トゥトゥ',
  'だ': 'トゥートゥ トゥトゥ',
  'ぢ': 'トゥトゥトゥートゥ トゥトゥ',
  'づ': 'トゥトゥートゥートゥ トゥトゥ',
  'で': 'トゥトゥートゥトゥートゥー トゥトゥ',
  'ど': 'トゥトゥトゥートゥトゥ トゥトゥ',
  'ば': 'トゥートゥトゥトゥ トゥトゥ',
  'び': 'トゥートゥートゥトゥトゥー トゥトゥ',
  'ぶ': 'トゥートゥートゥトゥ トゥトゥ',
  'べ': 'トゥ トゥトゥ',
  'ぼ': 'トゥートゥトゥ トゥトゥ',
  'ぱ': 'トゥートゥトゥトゥ トゥトゥトゥートゥートゥ',
  'ぴ': 'トゥートゥートゥトゥトゥー トゥトゥトゥートゥートゥ',
  'ぷ': 'トゥートゥートゥトゥ トゥトゥトゥートゥートゥ',
  'ぺ': 'トゥ トゥトゥトゥートゥートゥ',
  'ぽ': 'トゥートゥトゥ トゥトゥトゥートゥートゥ',

  'ぁ': 'トゥートゥートゥトゥートゥー',
  'ぃ': 'トゥトゥー',
  'ぅ': 'トゥトゥトゥー',
  'ぇ': 'トゥートゥトゥートゥートゥー',
  'ぉ': 'トゥトゥートゥトゥトゥ',

  'っ': 'トゥトゥートゥートゥ',

  'ゃ': 'トゥトゥートゥー',
  'ゅ': 'トゥートゥトゥトゥートゥー',
  'ょ': 'トゥートゥー',

  'ゎ': 'トゥートゥトゥー',

  '゛': 'トゥトゥ',
  '゜': 'トゥトゥトゥートゥートゥ',
}

const dictToOrigin = {
  'トゥートゥートゥトゥートゥー': 'あ',
  'トゥトゥー': 'い',
  'トゥトゥトゥー': 'う',
  'トゥートゥトゥートゥートゥー': 'え',
  'トゥトゥートゥトゥトゥ': 'お',
  'トゥトゥートゥトゥ': 'か',
  'トゥートゥトゥートゥトゥ': 'き',
  'トゥトゥトゥトゥー': 'く',
  'トゥートゥトゥートゥー': 'け',
  'トゥートゥートゥートゥー': 'こ',
  'トゥートゥトゥートゥトゥー': 'さ',
  'トゥートゥートゥトゥートゥ': 'し',
  'トゥートゥートゥートゥトゥー': 'す',
  'トゥトゥートゥートゥートゥ': 'せ',
  'トゥートゥートゥートゥ': 'そ',
  'トゥートゥ': 'た',
  'トゥトゥトゥートゥ': 'ち',
  'トゥトゥートゥートゥ': 'つ',
  'トゥトゥートゥトゥートゥー': 'て',
  'トゥトゥトゥートゥトゥ': 'と',
  'トゥトゥートゥ': 'な',
  'トゥートゥトゥートゥ': 'に',
  'トゥトゥトゥトゥ': 'ぬ',
  'トゥートゥートゥトゥー': 'ね',
  'トゥトゥトゥートゥー': 'の',
  'トゥートゥトゥトゥ': 'は',
  'トゥートゥートゥトゥトゥー': 'ひ',
  'トゥートゥートゥトゥ': 'ふ',
  'トゥ': 'へ',
  'トゥートゥトゥ': 'ほ',
  'トゥートゥトゥトゥー': 'ま',
  'トゥトゥトゥートゥトゥー': 'み',
  'トゥー': 'む',
  'トゥートゥトゥトゥトゥー': 'め',
  'トゥートゥトゥトゥートゥ': 'も',
  'トゥトゥートゥー': 'や',
  'トゥートゥトゥトゥートゥー': 'ゆ',
  'トゥートゥー': 'よ',
  'トゥトゥトゥ': 'ら',
  'トゥートゥートゥ': 'り',
  'トゥートゥトゥートゥートゥ': 'る',
  'トゥートゥートゥー': 'れ',
  'トゥトゥートゥトゥー': 'ろ',
  'トゥートゥトゥー': 'わ',
  'トゥトゥートゥトゥトゥー': 'ゐ',
  'トゥトゥートゥートゥトゥ': 'ゑ',
  'トゥトゥートゥートゥー': 'を',
  'トゥトゥートゥトゥートゥ': 'ん',

  'トゥトゥートゥトゥ トゥトゥ': 'が',
  'トゥートゥトゥートゥトゥ トゥトゥ': 'ぎ',
  'トゥトゥトゥトゥー トゥトゥ': 'ぐ',
  'トゥートゥトゥートゥー トゥトゥ': 'げ',
  'トゥートゥートゥートゥー トゥトゥ': 'ご',
  'トゥートゥトゥートゥトゥー トゥトゥ': 'ざ',
  'トゥートゥートゥトゥートゥ トゥトゥ': 'じ',
  'トゥートゥートゥートゥトゥー トゥトゥ': 'ず',
  'トゥトゥートゥートゥートゥ トゥトゥ': 'ぜ',
  'トゥートゥートゥートゥ トゥトゥ': 'ぞ',
  'トゥートゥ トゥトゥ': 'だ',
  'トゥトゥトゥートゥ トゥトゥ': 'ぢ',
  'トゥトゥートゥートゥ トゥトゥ': 'づ',
  'トゥトゥートゥトゥートゥー トゥトゥ': 'で',
  'トゥトゥトゥートゥトゥ トゥトゥ': 'ど',
  'トゥートゥトゥトゥ トゥトゥ': 'ば',
  'トゥートゥートゥトゥトゥー トゥトゥ': 'び',
  'トゥートゥートゥトゥ トゥトゥ': 'ぶ',
  'トゥ トゥトゥ': 'べ',
  'トゥートゥトゥ トゥトゥ': 'ぼ',
  'トゥートゥトゥトゥ トゥトゥトゥートゥートゥ': 'ぱ',
  'トゥートゥートゥトゥトゥー トゥトゥトゥートゥートゥ': 'ぴ',
  'トゥートゥートゥトゥ トゥトゥトゥートゥートゥ': 'ぷ',
  'トゥ トゥトゥトゥートゥートゥ': 'ぺ',
  'トゥートゥトゥ トゥトゥトゥートゥートゥ': 'ぽ',

  'トゥトゥ': '゛',
  'トゥトゥトゥートゥートゥ': '゜',
}


// ネイティオ語への翻訳
function convertToTwotwo(origin) {
  let result = []
  let i = 0
  while (i < origin.length) {
    const char = origin.charAt(i)
    const part = dictToTwotwo[char]
    result.push(part)
    i = i + 1
  }
  return result.join(' ')
}

function convertToOrigin(twotwo) {
  const parts = twotwo.split(' ')

  let result = []
  let i = 0
  while (i < parts.length) {
    const part = parts[i]
    const char = dictToOrigin[part]
    result.push(char)
    i = i + 1
  }
  return result.join('')
}

chrome.contextMenus.create({
  contexts: ['selection'],
  title: 'ネイティオ語を翻訳',
  onclick: function(param) {
    alert(convertToOrigin(param.selectionText))
  }
})

chrome.contextMenus.create({
  contexts: ['editable'],
  title: 'ネイティオ語に変換',
  onclick: function(param, tab) {
    const twotwo = convertToTwotwo(param.selectionText)
    chrome.tabs.sendMessage(tab.id, {
      text: twotwo
    })
  }
})
